app/controllers/api/v1/campus_locations_controller.rb

	def show
		@campus_location = CampusLocation.find(params[:id])
---
SELECT  "campus_locations".* FROM "campus_locations" WHERE "campus_locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]