app/controllers/api/v1/campus_locations_controller.rb

SELECT "campus_locations".* FROM "campus_locations"
---
	def index
		@campus_locations = CampusLocation.all

INSERT INTO "campus_locations" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "asdasd"], ["created_at", "2017-10-20 14:37:09.907591"], ["updated_at", "2017-10-20 14:37:09.907591"]]
---
	def create
		@campus_location = CampusLocation.new(campus_location_params)
		if @campus_location.save

UPDATE "campus_locations" SET "name" = ?, "updated_at" = ? WHERE "campus_locations"."id" = ?  [["name", "asd123"], ["updated_at", "2017-10-20 14:37:23.104940"], ["id", 6]]
---
	def update
		get_campus_location
		if @campus_location.update(campus_location_params)

DELETE FROM "campus_locations" WHERE "campus_locations"."id" = ?  [["id", 6]]
---
	def destroy
		get_campus_location
		if @campus_location.destroy