app/controllers/api/v1/dependences_controller.rb

SELECT "dependences".* FROM "dependences"
---
	def index
		@dependences = Dependence.all