app/controllers/api/v1/ticket_movements_controller.rb

	def index
		@ticket_movements = TicketMovement.all
---
SELECT "ticket_movements".* FROM "ticket_movements"