app/controllers/campus_locations_controller.rb

SELECT "campus_locations".* FROM "campus_locations"
---
	def index
		@campus = CampusLocation.all